Tekla.Structures.PluginsInternal.CDelegateWrapper


Tekla.Structures.PluginsInternal.CDelegateWrapper._Instance


Tekla.Structures.PluginsInternal.CDelegateWrapper._Functionality


Tekla.Structures.PluginsInternal.CDelegateWrapper.#ctor(Tekla.Structures.PluginsInternal.ICDelegate,Tekla.Structures.Internal.WrapperFunctionalityBase)
Instance:
Functionality:

Tekla.Structures.PluginsInternal.CDelegateWrapper.ExportGetPluginId


Tekla.Structures.PluginsInternal.CDelegateWrapper.ExportSetPluginResult(System.Int32)


Tekla.Structures.PluginsInternal.CDelegateWrapper.ExportExecutePluginResult(System.Int32)


Tekla.Structures.PluginsInternal.CDelegateWrapper.ExportGetConnectionCode(Tekla.Structures.Internal.dotConnectionCode_t@)


Tekla.Structures.PluginsInternal.CDelegateWrapper.ExportSetConnectionCode(Tekla.Structures.Internal.dotConnectionCode_t@)


Tekla.Structures.PluginsInternal.CDelegateWrapper.ExportGetPluginIntAttributes(Tekla.Structures.Internal.dotPluginAttributesInt_t@)


Tekla.Structures.PluginsInternal.CDelegateWrapper.ExportGetPluginDoubleAttributes(Tekla.Structures.Internal.dotPluginAttributesDouble_t@)


Tekla.Structures.PluginsInternal.CDelegateWrapper.ExportGetPluginStringAttributes(Tekla.Structures.Internal.dotPluginAttributesString_t@)


Tekla.Structures.PluginsInternal.CDelegateWrapper.DrawingExportAddPlugin(Tekla.Structures.Internal.dotPluginDefinition_t@)


Tekla.Structures.PluginsInternal.CDelegateWrapper.DrawingExportGetPluginInput(Tekla.Structures.Internal.dotPluginInput_t@)


Tekla.Structures.PluginsInternal.CDelegateWrapper.DrawingExportSetPluginInput(Tekla.Structures.Internal.dotPluginInput_t@)


Tekla.Structures.PluginsInternal.CDelegateWrapper.DrawingExportCurrentDefineInputClientId(Tekla.Structures.Internal.dotPluginClient_t@)


Tekla.Structures.PluginsInternal.CDelegateWrapper.DrawingExportDefineInputCompleted(Tekla.Structures.Internal.dotPluginClient_t@)


Tekla.Structures.PluginsInternal.CDelegateWrapper.DrawingExportPluginRunCompleted(Tekla.Structures.Internal.dotPluginClient_t@)


Tekla.Structures.PluginsInternal.CDelegateWrapper.ExportAddPlugin(Tekla.Structures.Internal.dotPluginDefinition_t@,Tekla.Structures.Internal.dotConnectionType_t@)


Tekla.Structures.PluginsInternal.CDelegateWrapper.ExportGetInput(Tekla.Structures.Internal.dotPluginInput_t@)


Tekla.Structures.PluginsInternal.CDelegateWrapper.ExportSetInput(Tekla.Structures.Internal.dotPluginInput_t@)


Tekla.Structures.PluginsInternal.CDelegateWrapper.ExportSignalInputEnded
